ci4_project/app/Controllers/Dashboard.php

    public function index()
    {
        $userModel = new UserModel();
        $parkingSlotModel = new ParkingSlotModel();

        $data['num_users'] = $userModel->countAll();
        $data['num_slots'] = $parkingSlotModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `parking_slots`