ci4_project/app/Controllers/ParkingSlotController.php

    public function index()
    {
        $data['slots'] = (new ParkingSlotModel())->findAll();
---
SELECT *
FROM `parking_slots`