ci4_project/app/Controllers/SlotsController.php

SELECT *
FROM `parking_slots`
---
    public function index()
    {
        $data['result'] = (new ParkingSlotModel())->findAll();