ci4_project/app/Controllers/UpdatebalanceController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function index()
    {
        // Get user's current balance
        $userId = session()->get('user_id'); // Replace with actual user ID
        $parkingModel = new UpdateBalanceModel();
        $userModel = new UserModel();
        $user = $userModel->find($userId); // Replace with actual method to get user