ci4_project/app/Controllers/UserDashboard.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index()
    {
        $session = session();
        $user_id = $session->get('user_id');
        $model = new UserModel();
        $data['users'] = $model->orderBy('id', 'DESC')->findAll();