ci4_project/app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function update($id)
    {
        $model = new UserModel();
         $data['user'] = $model->find($id);
        $data = [
        'name' => $this->request->getPost('name'),
        'email' => $this->request->getPost('email'),
        'phone' => $this->request->getPost('phone')
        ];
        $model->update($id, $data);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `name` = 'RogenAngeles', `email` = 'user12@yahoo.com', `phone` = '909073691'
WHERE `users`.`id` IN ('2')